rails_chat_system/app/controllers/applications_controller.rb

SELECT `applications`.* FROM `applications`
---
  def index
    applications = Application.all

INSERT INTO `applications` (`token`, `name`, `created_at`, `updated_at`) VALUES ('95e6e5d7-2bac-4c6b-b88e-1e02365e8749', 'My app 1', '2024-09-27 19:58:16.748413', '2024-09-27 19:58:16.748413')
---
  def create
    application = Application.new(application_params)
    if application.save